tap "homebrew-zathura/zathura", "https://github.com/homebrew-zathura/homebrew-zathura.git"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Next generation open source RPC library and framework
brew "grpc"
# Next-gen compiler infrastructure
brew "llvm"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Command-line utilities for working with desktop entries
brew "desktop-file-utils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Geometry Engine
brew "geos"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Common components for zathura
brew "girara"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GUI toolkit
brew "gtk+"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Convert HTML to PDF or PostScript
brew "htmldoc"
# Improved top (interactive process viewer)
brew "htop"
# Utility to optimize JPEG files
brew "jpegoptim"
# Keyboard handling library
brew "libxkbcommon"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Fast and user friendly build system
brew "meson"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Rsync for cloud storage
brew "rclone"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Photography workflow application and raw developer
cask "darktable"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# RAW photo processor
cask "rawtherapee"
# PDF reader and note-taking application
cask "skim"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "ggml-org.llama-vscode"
vscode "huyigong.vscode-latex-commands"
vscode "james-yu.latex-workshop"
vscode "jeffersonqin.latex-snippets-jeff"
vscode "maltehei.latex-citations"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "percy.vscode-pydata-viewer"
vscode "randomfractalsinc.geo-data-viewer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "smartmonkey.geotools"
vscode "techer.open-in-browser"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "vomout.latex-syntax"
vscode "vscodevim.vim"
vscode "yongke.latex-wordcount"
npm "@anthropic-ai/claude-code"
npm "corepack"
