bracketpaircolordlw.bracket-pair-color-dlw
ggml-org.llama-vscode
huyigong.vscode-latex-commands
james-yu.latex-workshop
jeffersonqin.latex-snippets-jeff
maltehei.latex-citations
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-hub
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
percy.vscode-pydata-viewer
randomfractalsinc.geo-data-viewer
shd101wyy.markdown-preview-enhanced
smartmonkey.geotools
techer.open-in-browser
tecosaur.latex-utilities
tomoki1207.pdf
vomout.latex-syntax
vscodevim.vim
yongke.latex-wordcount
